#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_id.db_name_suffix: Refreshing state... [id=KugJqA]
random_id.secret_placeholder: Refreshing state... [id=o5Xg7aVk0rQ6HHpiiKMbTg]
random_password.db_password: Refreshing state... [id=none]
google_project_service.required_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=product-finder-478702/artifactregistry.googleapis.com]
data.google_iam_policy.noauth: Reading...
google_project_service.required_apis["compute.googleapis.com"]: Refreshing state... [id=product-finder-478702/compute.googleapis.com]
google_project_service.required_apis["run.googleapis.com"]: Refreshing state... [id=product-finder-478702/run.googleapis.com]
google_project_service.required_apis["vpcaccess.googleapis.com"]: Refreshing state... [id=product-finder-478702/vpcaccess.googleapis.com]
google_project_service.required_apis["secretmanager.googleapis.com"]: Refreshing state... [id=product-finder-478702/secretmanager.googleapis.com]
google_project_service.required_apis["sqladmin.googleapis.com"]: Refreshing state... [id=product-finder-478702/sqladmin.googleapis.com]
google_project_service.required_apis["servicenetworking.googleapis.com"]: Refreshing state... [id=product-finder-478702/servicenetworking.googleapis.com]
google_service_account.cloud_run_sa: Refreshing state... [id=projects/product-finder-478702/serviceAccounts/product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_project_iam_member.cloud_run_sql_client: Refreshing state... [id=product-finder-478702/roles/cloudsql.client/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret.django_superuser_password: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-django-superuser-password]
google_secret_manager_secret.default_llm_provider: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-default-llm-provider]
google_secret_manager_secret.django_superuser_username: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-django-superuser-username]
google_secret_manager_secret.de_product_api_base_url: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-de-product-api-base-url]
google_secret_manager_secret.de_product_field_names: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-de-product-field-names]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/product-finder-478702/locations/us-east1/repositories/product-finder-staging]
google_secret_manager_secret.django_secret_key: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-django-secret-key]
google_secret_manager_secret.openai_api_key: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-openai-api-key]
google_secret_manager_secret.de_product_auth_key: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-de-product-auth-key]
google_secret_manager_secret.django_superuser_email: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-django-superuser-email]
google_secret_manager_secret.de_product_app_key: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-de-product-app-key]
google_secret_manager_secret.perplexity_api_key: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-perplexity-api-key]
google_compute_network.vpc: Refreshing state... [id=projects/product-finder-478702/global/networks/product-finder-staging-vpc]
google_secret_manager_secret.database_url: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-database-url]
google_secret_manager_secret_version.default_llm_provider: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-default-llm-provider/versions/latest]
google_secret_manager_secret_version.de_product_auth_key: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-de-product-auth-key/versions/latest]
google_secret_manager_secret_iam_member.default_llm_provider: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-default-llm-provider/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.de_product_auth_key: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-de-product-auth-key/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.django_superuser_password: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-django-superuser-password/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_version.de_product_api_base_url: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-de-product-api-base-url/versions/latest]
google_secret_manager_secret_iam_member.de_product_api_base_url: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-de-product-api-base-url/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.de_product_field_names: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-de-product-field-names/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_version.de_product_field_names: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-de-product-field-names/versions/latest]
google_secret_manager_secret_iam_member.django_secret_key: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-django-secret-key/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_version.openai_api_key: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-openai-api-key/versions/latest]
google_secret_manager_secret_iam_member.openai_api_key: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-openai-api-key/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.perplexity_api_key: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-perplexity-api-key/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_version.perplexity_api_key: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-perplexity-api-key/versions/latest]
google_secret_manager_secret_iam_member.django_superuser_email: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-django-superuser-email/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.django_superuser_username: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-django-superuser-username/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_version.de_product_app_key: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-de-product-app-key/versions/latest]
google_secret_manager_secret_iam_member.de_product_app_key: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-de-product-app-key/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.database_url: Refreshing state... [id=projects/product-finder-478702/secrets/product-finder-staging-database-url/roles/secretmanager.secretAccessor/serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/product-finder-478702/global/addresses/product-finder-staging-private-ip]
google_vpc_access_connector.connector: Refreshing state... [id=projects/product-finder-478702/locations/us-east1/connectors/pf-staging-connector]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fproduct-finder-478702%2Fglobal%2Fnetworks%2Fproduct-finder-staging-vpc:servicenetworking.googleapis.com]
google_sql_database_instance.postgres: Refreshing state... [id=product-finder-staging-2ae809a8]
google_sql_database.database: Refreshing state... [id=projects/product-finder-478702/instances/product-finder-staging-2ae809a8/databases/product_finder]
google_sql_user.db_user: Refreshing state... [id=product_finder_user//product-finder-staging-2ae809a8]
module.seed_llm_prompts.google_cloud_run_v2_job.task_runner: Refreshing state... [id=projects/product-finder-478702/locations/us-east1/jobs/seed-llm-prompts]
module.createsuperuser.google_cloud_run_v2_job.task_runner: Refreshing state... [id=projects/product-finder-478702/locations/us-east1/jobs/django-createsuperuser]
google_cloud_run_v2_service.app: Refreshing state... [id=projects/product-finder-478702/locations/us-east1/services/product-finder-staging]
google_cloud_run_v2_service_iam_policy.noauth: Refreshing state... [id=projects/product-finder-478702/locations/us-east1/services/product-finder-staging]
google_secret_manager_secret_version.database_url: Refreshing state... [id=projects/329270625966/secrets/product-finder-staging-database-url/versions/2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_firestore_database.database will be created
  + resource "google_firestore_database" "database" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-east1"
      + name                              = "(default)"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "product-finder-478702"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_project_iam_member.cloud_run_firestore_user will be created
  + resource "google_project_iam_member" "cloud_run_firestore_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:product-finder-staging-cr-sa@product-finder-478702.iam.gserviceaccount.com"
      + project = "product-finder-478702"
      + role    = "roles/datastore.user"
    }

  # google_project_service.firestore will be created
  + resource "google_project_service" "firestore" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "product-finder-478702"
      + service            = "firestore.googleapis.com"
    }

  # google_sql_database_instance.postgres will be updated in-place
  ~ resource "google_sql_database_instance" "postgres" {
        id                             = "product-finder-staging-2ae809a8"
        name                           = "product-finder-staging-2ae809a8"
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # random_password.db_password will be updated in-place
  ~ resource "random_password" "db_password" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @mmacaulay, Action: `pull_request`*